/* MJP hack to fix <rdar://problem/3808962> TA8A241Plus:Sharing Pref: The display of information about Windows Sharing was not good. */
"USE_SPECIAL_FONT" = "NO"; /*Set to "YES" to use font specified by next string */
"SPECIAL_FONT" = "LiHeiPro";

/* Generic strings */
"OK" = "OK";
"CANCEL" = "Cancel";
"QUIT" = "Quit";
"STOP" = "Stop";
"START" = "Start";
"WARNING" = "Warning";
"ERROR" = "Error";
"ON" = "On";
"OFF" = "Off";
"STARTING" = "Starting Up…";
"STOPPING" = "Shutting Down…";
"UNAVAILABLE" = "Not Available";
"UNKNOWN" = "Unknown";
"ADD" = "Add";
"OTHER..." = "Other…";
"UNKNOWN_USER" = "Unknown User";

// Common ACL names
"Administrators" = "Administrators";
"Everyone" = "Everyone";

"AX_DESCR_ADD_SP" = "Add Share point";
"AX_DESCR_REMOVE_SP" = "Remove share point";
"AX_DESCR_ADD_USER" = "Add user";
"AX_DESCR_REMOVE_USER" = "Remove user";

"AX_DESCR_USERS" = "Users";
"AX_DESCR_SHAREPOINTS" = "Share points";

"AX_DESCR_FOR_NSStatusUnknown" = "Status off indicator";
"AX_DESCR_FOR_NSStatusAvailable" = "Status on indicator";
"AX_DESCR_FOR_NSStatusAway" = "Status error indicator";
"AX_DESCR_FOR_NSStatusIdle" = "Status warning indicator";

/* ES warnings */
"ESWARNING_TITLE" = "This computer is set to sleep after a period of inactivity.";
"ESWARNING_OPEN_ES" = "Open Energy Saver…";
"ESWARNING_DESC" = "Sharing services are unavailable during sleep. To change the settings, open Energy Saver preferences.";

/* Services (for the table view)*/
"REMOTE_LOGIN_LABEL" = "Remote Login";

/* telnet service */
"CAPTION_TELNET_IS_ON" = "Turn on remote telnet access";
"CAPTION_TELNET_IS_OFF" = "Turn off remote telnet access";

/* Rendezvous Tool Tip */
"RENDEZVOUS_NAME_ERR" = "The Bonjour Name is invalid.";
"RENDEZVOUS_TOOL_TIP" = "The Bonjour Name must start and end with a letter or digit.\nThe interior characters must consist of only letters, digits, and hyphens.";
"RENDEZ_EXPL" = "Computers on your local network can access your computer at: %@.local";
"NAME_EXPL" = "Others can access your computer locally at %@.local or globally at %@.";


/* AFP server */
"CAPTION_AFP_IS_ON" = "File Sharing: On";
"CAPTION_AFP_IS_STARTING" = "File Sharing starting…";
"DESCR_AFP" = "File Sharing allows other users to access shared folders on this computer and allows administrators to access all volumes.";
"CAPTION_AFP_IS_OFF" = "File Sharing: Off";
"CAPTION_AFP_IS_BLOCKED_BY_FIREWALL" = "File Sharing: Blocked by Firewall";

"CAPTION_AFP_IS_STOPING" = "File Sharing stopping…";
"CAPTION_AFP_IS_STOPING_IN" = "File sharing will stop in %d minute(s)";
"CAPTION_AFP_IS_STOPING_SOON" = "File Sharing stopping in less than 1 minute";

"DESCR_AFP_WILL_STOP" = "File Sharing allows users of other computers to access Public folders on this computer.";
"DESCR_AFP_IS_STOPING_IN" = "File Sharing is stopping in %li minute(s).";
"DESCR_AFP_IS_STOPING_SOON" = "File Sharing stopping in less than 1 minute.";

"AFP_INFO_TEXT" = "Other users can access shared folders on this computer, and administrators all volumes, at %@ or \“%@\”.";
"AFP_INFO_TEXT_SHORT" = "Other users can access shared folders on this computer, and administrators all volumes, at %@.";
"AFP_URL" = "afp://%@/";

"SP_DELETE_TITLE_SINGLE" = "Are you sure you want to stop sharing the folder \“%@?\”";
"IDENTITY_DELETE_TITLE" = "Are you sure you want to remove \“%@\” from the list of users allowed to access the shared folder \“%@?\”";

"PUBLIC_SHAREPOINT_NAME" = "%@’s Public Folder";

/* Samba Server */
"CAPTION_SAMBA_IS_ON" = "Windows Sharing: On";
"CAPTION_SAMBA_IS_OFF" = "Windows Sharing: Off";
"CAPTION_SAMBA_IS_BLOCKED_BY_FIREWALL" = "Windows Sharing: Blocked by Firewall";

"SAMBA_ACCOUNTS_BUTTON" = "Accounts…";

"SAMBA_INFO_TEXT" = "Windows users can access shared folders on this computer, and administrators all volumes, at %@.";

//"SAMBA_INFO_TEXT" = "Windows users can access your computer at %@\nOther users can access your computer at %@";
"SAMBA_ENABLED_ACCOUNTS" = "Enabled accounts: ";
"SEPARATOR" = ", ";
"SAMBA_ADDRESS" = "\\\\%@\\%@";
"SAMBA_IS_NOT_AVAILABLE" = "Windows File Sharing is not installed on this computer. To install Windows File Sharing, use the Mac OS X installer.";
"SAMBA_ADDRESS_URL" = "smb://%@";

"SMB_IS_STARTING" = "Windows File Sharing starting…";
"SMB_IS_STOPPING" = "Windows File Sharing stopping…";

/* Windows File Sharing password strings */
"SAMBA_ENABLE_PASSWORD_TEXT" = "To enable file sharing using SMB for \“%@\”, enter the password for that account.";
"SAMBA_DISABLE_PASSWORD_TEXT" = "To disable file sharing using SMB for \“%@\”, enter the password for that account.";

/* Password is too short */
"PASS_IS_TOO_SHORT_ERR" = "The password must be at least 4 characters long. Retype the password.";

/* Web server */
"CAPTION_WEB_IS_ON" = "Web Sharing: On";
"CAPTION_WEB_IS_OFF" = "Web Sharing: Off";
"CAPTION_WEB_IS_BLOCKED_BY_FIREWALL" = "Web Sharing: Blocked by Firewall";
"CAPTION_WEB_IS_STARTING" = "Web Sharing starting…";
"DESCR_WEB_GENERAL" = "Web Sharing allows users of other computers to view webpages on this computer.";
"CAPTION_WEB_IS_STOPING" = "Web Sharing stopping…";
"WEB_IS_NOT_AVAILABLE" = "Web Sharing is not installed on this computer. To install Web Sharing, use the Mac OS X installer.";
"WEB_URL" = "http://%@/";
"WEB_URL_PERSONAL" = "http://%@/~%@/";

/* Optical Disc Sharing */
"Optical Disc Sharing" = "DVD or CD Sharing";
"CAPTION_OPTICAL_DISC_SHARING_IS_OFF" = "DVD or CD Sharing: Off";
"CAPTION_OPTICAL_DISC_SHARING_IS_ON" = "DVD or CD Sharing: On";
"CAPTION_OPTICAL_DISC_SHARING_IS_BLOCKED_BY_FIREWALL" = "DVD or CD Sharing: Blocked by Firewall";
"CAPTION_OPTICAL_DISC_SHARING_IS_STARTING" = "DVD or CD Sharing starting…";
"CAPTION_OPTICAL_DISC_SHARING_IS_STOPPING" = "DVD or CD Sharing stopping…";
"DESCR_OPTICALDISK_SHARING_GENERAL" = "This allows users of other computers to use this computer’s DVD or CD drive remotely.";
"ODS_DVD_ASK_TITLE" = "Ask me before allowing others to use my DVD drive";
"ODS_CD_ASK_TITLE" = "Ask me before allowing others to use my CD drive";

/* FTP */
"FTP_IS_ON" = "FTP Access: On";
"FTP_IS_OFF" = "FTP Access: Off";
"FTP_IS_NOT_AVAILABLE" = "FTP is not installed on this computer. To install FTP, install the BSD packages using the Mac OS X Installer.";
"FTP_BASIC_DESCR" = "FTP allows users of other computers to exchange files with this computer using FTP applications.";
"FTP_IS_BLOCKED_BY_FIREWALL" = "FTP Access: Blocked by Firewall";

"FTP_INFO_TEXT" = "Other people can access your FTP server at\nftp://%@/ or browse for \“%@\”.";
"AFP_NUMBER_OF_CLIENTS" = "Number of users connected: %d";

"FTP_IS_STARTING" = "FTP starting…";
"FTP_IS_STOPPING" = "FTP stopping…";

/* SSH */
"CAPTION_SSH_IS_STARTING" = "Remote Login starting…";
"CAPTION_SSH_IS_STOPPING" = "Remote Login stopping…";
"SSH_INFO_GENERAL" = "Remote Login lets users of other computers access this computer using SSH.";
"SSH_ON" = "Remote Login: On";
"SSH_OFF" = "Remote Login: Off";
"SSH_INFO_TEXT" = "To log in to this computer remotely, type \"ssh %@@%@\".";
"SSH_BLOCKED_BY_FIREWALL" = "Remote Login: Blocked by Firewall";

/* Alerts */
"FTP_MISSING_ERR" = "Your FTP settings cannot be modified because the BSD package has not been installed.";
"FTP_MISSING_EXPLANATION" = "Please install the BSD package if you want to modify your FTP settings."; 

/* Firewall Strings */
"FIREWALL_ON" = "Firewall On";
"FIREWALL_OFF" = "Firewall Off";
"FIREWALL_UNA" = "Firewall Unavailable";
"ERROR_FIREWALL" = "You cannot change the firewall settings because there was an error reading them from your system.";
"ERROR_FIREWALL_EXPL" = "If the problem persists, restart your computer and try again.";
"DEFAULT_ENTRY" = "You cannot change the firewall settings for this service.";
"TOOL_TIP_OFF_TCP" = "This is your firewall entry for %@.\nIt is currently off and all TCP network traffic on port(s) %@ is being blocked.";
"TOOL_TIP_OFF_UDP" = "This is your firewall entry for %@.\nIt is currently off and all UDP network traffic on port(s) %@ is being blocked.";
"TOOL_TIP_OFF_BOTH" = "This is your firewall entry for %@.\nIt is currently off and all TCP network traffic on port(s) %@ and all UDP network traffic on port(s) %@ is being blocked.";

/* Firewall Utility Strings */
"FILE_AND_WEB" = "File & Web";
"APPLICATION" = "Application";

/* Sharing Pref Defined Services */
/* Do not delete these, they are for localizing the UI (the file is always stored in English) */
"Apple Remote Desktop" = "Apple Remote Desktop";
"ARD_TITLE" = "Remote Management";
"SCREEN_SHARING_TITLE" = "Screen Sharing";
"Personal File Sharing" = "File Sharing";
"Samba Sharing" = "Windows Sharing";
"Personal Web Sharing" = "Web Sharing";
"Remote Login - SSH" = "Remote Login - SSH";
"Remote Apple Events" = "Remote Apple Events";
"FTP Access" = "FTP Access";
"BlueToothService" = "Bluetooth Sharing";
"Printer Sharing" = "Printer Sharing";
"Scanner Sharing" = "Scanner Sharing";
"iChat Rendezvous" = "iChat Bonjour";
"iTunes Music Sharing" = "iTunes Music Sharing";
"iPhoto Rendezvous Sharing" = "iPhoto Bonjour Sharing";
"Network Time" = "Network Time";
"Dynamic DNS" = "Dynamic DNS";
"Xgrid" = "Xgrid Sharing";

/* BT */
"BT_INFO_TEXT" = "Use Bluetooth Sharing preferences and set up your computer to share files with other Bluetooth enabled computers and devices.";
"BT_IS_ON" = "Bluetooth Sharing: On";
"BT_IS_OFF" = "Bluetooth Sharing: Off";

/* Printer Sharing */
"PRINTER_SHARING_UNAVAILABLE" = "Printer Sharing is currently unavailable.";
"PS_IS_ON" = "Printer Sharing: On";
"PS_IS_OFF" = "Printer Sharing: Off";
"PS_IS_BLOCKED_BY_FIREWALL" = "Printer Sharing: Blocked by Firewall";
"PS_IS_STARTING" = "Printer Sharing starting…";
"PS_IS_STOPPING" = "Printer Sharing stopping…";
"PRINTER_SHARING_BASIC" = "Printer Sharing allows others on your network to use printers connected to this computer.";
"PRINTER_FAX_SHARING_BASIC" = "Printer Sharing allows others on your network to use printers and fax modems connected to this computer.";

/* Scanner Sharing */
"SCANNERSHARING_IS_ON" = "Scanner Sharing: On";
"SCANNERSHARING_IS_OFF" = "Scanner Sharing: Off";

/* Remote Apple Events */
"REMOTE_AE_ON" = "Remote Apple Events: On";
"REMOTE_AE_OFF" = "Remote Apple Events: Off";
"REMOTE_AE__BLOCKED_BY_FIREWALL" = "Remote Apple Events: Blocked by Firewall";
"RAE_IS_STARTING" = "Remote Apple Events starting…";
"RAE_IS_STOPPING" = "Remote Apple Events stopping…";
"AE_BUTTON_TITLE" = "Configure…";
"RAE_PICKER_TITLE" = "Remote Apple Events";
"SSH_PICKER_TITLE" = "Remote Login";

/* ARD */
"ARD_ON" = "Remote Management: On";
"ARD_OFF" = "Remote Management: Off";
"ARD_BLOCKED_BY_FIREWALL" = "Remote Management: Blocked by Firewall";
"ARD_GENERAL_INFO_TEXT" = "Remote Management allows other users to access this computer using Apple Remote Desktop.";
"SCREEN_SHARING_GENERAL_INFO_TEXT" = "Screen Sharing allows users of other computers to remotely view and control this computer.";
"ARD_INFO_TEXT" = "Other users can manage your computer using the address\n%@.";
"ARD_URL" = "http://www.apple.com/remotedesktop/";
"ARD_ACCESS_BUTTON" = "Access Privileges…";
"ARD_MENU_EXTRA_CHECKBOX" = "Show status in menu bar";
"CAPTION_ARD_IS_STARTING" = "Remote Management starting…";
"CAPTION_ARD_IS_STOPPING" = "Remote Management stopping…";
"ARD_STARTING_DESC" = "Remote Management allows administrators to observe your screen and manage your computer using the %@ program.";
"ARD_IS_NOT_AVAILABLE" = "Remote Management is not installed on this computer.";
"ARD_CONTROL_OBSERVE" = "Control and observe";
"SCREEN_SHARING_INFO" = "Other users can access your computer at vnc://%@/ or browse for \“%@\”.";
"SCREEN_SHARING_INFO_SHORT" = "Other users can access your computer at vnc://%@/.";
"SCREEN_SHARING_ON" = "Screen Sharing: On";
"SCREEN_SHARING_OFF" = "Screen Sharing: Off";
"SCREEN_SHARING_BLOCKED_BY_FIREWALL" = "Screen Sharing: Blocked by Firewall";
"SCREEN_SHARING_OFF_WARNING_TITLE" = "Are you sure you want to turn off screen sharing on the computer \“%@\”?";
"SCREEN_SHARING_OFF_WARNING_DESC" = "If you turn off screen sharing on this computer, other computers sharing its screen won’t be able to access it.";

/* NAT (Internet Sharing) */
"Internet Sharing" = "Internet Sharing";
"INTERNET_SHARING_ON" = "Internet Sharing: On";
"INTERNET_SHARING_OFF" = "Internet Sharing: Off";
"INTERNET_SHARING_MESSAGE" = "Internet Sharing allows other computers to share your connection to the Internet.";
"INTERNET_SHARING_SELECT_OUT" = "You cannot start Internet Sharing because you have not selected a port to share your connection.";
"INTERNET_SHARING_NO_OUT" = "You cannot start Internet sharing because there are no ports available to share your connection. Choose a different connection to share or turn on another port using Network preferences.";
"INTERNET_SHARING_NO_FROM" = "You cannot start Internet Sharing because there are no open Internet connections. To open an Internet connection, use Network preferences.";
"INTERNET_SHARING_NOT_AVAILABLE" = "Internet Sharing is not available because you do not currently have an active Internet connection.";
"AUTOMATIC" = "Automatic";
"PRIMARY_INTERFACE_WARNING" = "If you turn on this port, your Internet Service provider might terminate your service to prevent you from disrupting its network.";
"PRIMARY_INTERFACE_EXPL" = "In some cases (if you use a cable modem, for example) you might unintentionally affect the network settings of your ISP and violate the terms of your service agreement.";
"INTERNET_SHARING_NETWORK" = "Internet Sharing Network";
"INTERNET_SHARING_ARE_YOU_SURE" = "Are you sure you want to turn on Internet sharing?";
"INTERNET_SHARING_ARE_YOU_SURE_INFO" = "If your computer is connected to a network, turning on Internet sharing may affect the network settings of other computers and disrupt the network. Contact your system administrator before turning on Internet sharing.";
"INTERNET_SHARING_NO_SERVICES" = "No active services available";
"INTERNET_SHARING_NOT_INSTALLED" = "Internet Sharing is not installed on this computer. To install Internet Sharing, install the BSD packages using the Mac OS X Installer.";

"AIRPORT_WARNING" = "To share your Internet connection, you must turn on AirPort.";
"AIRPORT_WARNING_INFO" = "AirPort is turned off.";
"TURN_POWER_ON" = "Turn AirPort On";
"DEFAULT_AIRPORT_NETWORK" = "AirPort Network";
"NETWORK_PASSWORD" = "To connect to the AirPort network created by this computer from a computer not using AirPort software, use the following equivalent network password (WEP key):";

"INTERNET_SHARING_SLEEP_WARNING_SHEET_ENERGY_SAVER_BUTTON" = "Open Energy Saver";
"INTERNET_SHARING_WEBSHARING_WARNING_SHEET_SERVICES_BUTTON" = "Show Services";
"INTERNET_SHARING_WARNING_SHEET_TITLE" = "Other settings may interfere with Internet Sharing";

/* Extra Firewall Ports */
"APPLE_REMOTE_DESKTOP" = "Apple Remote Desktop";
"ICQ" = "ICQ";
"IRC" = "IRC";
"MSN" = "MSN Messenger";
"RETROSPECT" = "Retrospect";
"SMB" = "SMB (without netbios)";
"TIMBUKTU" = "Timbuktu";
"RENDEZVOUS" = "Bonjour Instant Messaging";
"VNC" = "VNC";
"NETWORKTIME" = "Network Time";
"CVS" = "CVS";
"WEBSTAR" = "WebSTAR Admin";
"XCODE" = "Xcode distributed build";
"QUICKTIME" = "QuickTime";
"WBEM" = "WBEM";

/* Dynamic DNS */
"DYNDNS_ON" = "Dynamic DNS Sharing On";
"DYNDNS_OFF" = "Dynamic DNS Sharing Off";
"CAPTION_DYNDNS_IS_STARTING" = "Dynamic DNS starting…";
"CAPTION_DYNDNS_IS_STOPPING" = "Dynamic DNS stopping…";
"DYNDNS_INFO_TEXT" = "Other people can access your computer remotely at \“%@\”.";
"DYNDNS_STARTING_DESC" = "Dynamic DNS allows users of other computers to connect to your computer through your Dynamic DNS domain.";
"DYNDNS_BUTTON_STRING" = "Configure…";
"DYNDNS_HAS_SECRET" = "<set>";
"DYNDNS_NO_SECRET" = "<none>";
"DYNDNS_FAILED_SHEET_TITLE" = "Dynamic DNS Not Started";
"DYNDNS_FAILED_SHEET_MESSAGE" = "Dynamic DNS failed to register \“%@\”.\n\n%@";
"DYNDNS_START_TIMEOUT" = "Dynamic DNS timed out while starting.  Check your settings and try again.";
"DYNDNS_NO_SERVERS_AVAILABLE" = "None Available";

/* Status messages for mDNSResponder respondes about dynamic dns */
"MDNS_RESPONSE_UNKNOWN_ERROR" = "An unknown error has occurred.";
"MDNS_RESPONSE_NONETWORK_ERROR" = "There is a problem connecting to the network. Make sure your cables are connected properly and try again.";
"MDNS_RESPONSE_NODNSSERVER_ERROR" = "Your computer is unable to contact a DNS server. Check Network preferences and make sure the address for the DNS server is correct.";
"MDNS_RESPONSE_COMPUTERNAMEINUSE_ERROR" = "A computer with the name @#$@ is in use by another user. Change your computer name or try again later.";
"MDNS_RESPONSE_NATTRAVESAL_ERROR" = "This computer is connected to the Internet through a gateway that doesn’t allow it to act as a server on the Internet.";
"MDNS_RESPONSE_FIREWALL_ERROR" = "The selected DNS server could not make this computer visible to other computers on the Internet. It may be behind a firewall.";

"XGRID_ON" = "Xgrid Sharing: On";
"XGRID_OFF" = "Xgrid Sharing: Off";
"CAPTION_XGRID_IS_STARTING" = "Xgrid agent starting…";
"CAPTION_XGRID_IS_STOPPING" = "Xgrid agent stopping…";
"XGRID_INFO_TEXT" = "The Xgrid agent is active.";
"XGRID_STARTING_DESC" = "Xgrid Sharing allows Xgrid controllers to connect and distribute Xgrid tasks to be performed on your computer.";
"XGRID_ADV_BUTTON" = "Configure…";
"XGRID_START_TIMEOUT" = "There was a problem starting the Xgrid agent.";
"XGRID_STOP_TIMEOUT" = "There was a problem stopping the Xgrid agent.";
"XGRID_NO_AGENT_TITLE" = "Xgrid agent not found";
"XGRID_NO_AGENT_DESC" = "The Xgrid agent needs to be installed on this computer in order to enable Xgrid sharing.";
"XGRID_MISSING_PASSWORD_TITLE" = "Missing password";
"XGRID_MISSING_PASSWORD_INFO" = "The agent is currently set up to require the Xgrid controller to provide a password, but a password has not been set.  You must set a password or disable the password requirement before you can start the agent.";
"XGRID_SECURITY_WARNING_TITLE" = "Security warning";
"XGRID_SECURITY_WARNING_INFO" = "By turning off the password requirement, you may be allowing unauthorized access to your computer.";
"XGRID_GENERAL_INFO" = "Xgrid Sharing allows Xgrid controllers to connect and distribute Xgrid tasks to be performed on your computer.";

"LABEL_SHAREDFOLDERS" = "Shared Folders:";
"LABEL_USERSGROUPS" = "Users:";

"APPLY_PERMISSION_MAIN_TEXT" = "Are you sure you want to apply the selected owner, group, and permissions to all the enclosed items?";
"APPLY_PERMISSION_PROGRESS_LABEL" = "Applying privileges to \“%@\”";
